app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
    render :layout => false
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 14 May 2012 22:17:10 UTC +00:00], ["email", "asdasd"], ["name", "asdasd"], ["updated_at", Mon, 14 May 2012 22:17:10 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])
    UserMailer.welcome_email(@user).deliver
    respond_to do |format|
      if @user.save